#  K-Nearest Neighbor

- 기존 데이터 중 가장 유사한 k개의 데이터를 이용해서 새로운 데이터를 예측

- 특징
    - 최고 인접 다수결
        - 기존 데이터 중 가장 유사한 k개의 데이터를 측정하여 분류
    - Lazy learning 기법
        - 새로운 입력 값이 들어온 후 분류 시작
        - 데이터셋을 저장만 하고 일반화된 모델을 능동적으로 만들지 않음
    - 단순 유연성
        -모형이 단순하며 파라미터의 가정이 거의 없음
- 장점
    - 학습이 간단
    - 훈련데이터의 크기가 클수록 정확해짐
    - 모형이 단순하고 쉽게 구현할 수 있음
    
- 단점
    - k값 선정에 따라 성능이 좌우됨
    - 높은 자원 요구량
        - 데이터셋 전체를 메모리에 기억
    - 계산 복잡성
        - 모든 데이터와의 거리 측정 수행이 필요

In [1]:
import pandas as pd
import seaborn as sns
from sklearn import preprocessing
from sklearn.model_selection import train_test_split
from sklearn.neighbors import KNeighborsClassifier
from sklearn import metrics

# 데이터 준비

In [2]:
# load_dataset 함수를 사용하여 데이터프레임으로 변환
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

# 데이터 탐색

In [3]:
# 데이터 자료형 확인
df.info()
#info를쓰면 null값 보기 편하다

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [4]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64